# BigQuery query magic

Jupyter magics are notebook-specific shortcuts that allow you to run commands with minimal syntax. Jupyter notebooks come with many [built-in commands](https://ipython.readthedocs.io/en/stable/interactive/magics.html). The BigQuery client library, `google-cloud-bigquery`, provides a cell magic, `%%bigquery`. The `%%bigquery` magic runs a SQL query and returns the results as a pandas `DataFrame`.

## Run a query on a public dataset

The following example queries the BigQuery `usa_names` public dataset. `usa_names` is a Social Security Administration dataset that contains all names from Social Security card applications for births that occurred in the United States after 1879.

The following example shows how to invoke the magic (`%%bigquery`), and how to pass in a standard SQL query in the body of the code cell. The results are displayed below the input cell as a pandas [`DataFrame`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html).

In [3]:
%%bigquery
SELECT name, SUM(number) as count
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY count DESC
LIMIT 10

      name    count
0    James  5029035
1     John  4894381
2   Robert  4754178
3  Michael  4377398
4  William  3914954
5     Mary  3753203
6    David  3615136
7  Richard  2546952
8   Joseph  2537788
9  Charles  2287121

In [2]:
!gcloud ai-platform versions create $VERSION_NAME \
    --model=$MODEL_NAME \
    --origin=$MODEL_DIR \
    --region=us-central1 \
    --python-version=3.7 \
    --runtime-version=2.1 \
    --machine-type=n1-standard-2 #default machine type to host your model

ERROR: (gcloud.ai-platform.versions.create) unrecognized arguments:
  --region=us-central1 (did you mean '--origin'?)
  --machine-type=n1-standard-2
  To search the help text of gcloud commands, run:
  gcloud help -- SEARCH_TERMS

## Display verbose output

As the query job is running, status messages below the cell update with the query job ID and the amount of time the query has been running. By default, this output is erased and replaced with the results of the query. If you pass the `--verbose` flag, the output will remain below the cell after query completion.

In [4]:
%%bigquery --verbose
SELECT name, SUM(number) as count
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY count DESC
LIMIT 10

Executing query with job ID: 1f5d2781-8482-4c86-8941-2866be5d691e
Query executing: 0.37s
Query complete after 0.48s

      name    count
0    James  5029035
1     John  4894381
2   Robert  4754178
3  Michael  4377398
4  William  3914954
5     Mary  3753203
6    David  3615136
7  Richard  2546952
8   Joseph  2537788
9  Charles  2287121

## Explicitly specify a project

By default, the `%%bigquery` magic command uses your default project to run the query. You may also explicitly provide a project ID using the `--project` flag. Note that your credentials must have permissions to create query jobs in the project you specify.

In [1]:
project_id = 'remy-sandbox'

In [2]:
%%bigquery --project $project_id
SELECT name, SUM(number) as count
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY count DESC
LIMIT 10

      name    count
0    James  5029035
1     John  4894381
2   Robert  4754178
3  Michael  4377398
4  William  3914954
5     Mary  3753203
6    David  3615136
7  Richard  2546952
8   Joseph  2537788
9  Charles  2287121

## Assign the query results to a variable

To save the results of your query to a variable, provide a variable name as a parameter to `%%bigquery`. The following example saves the results of the query to a variable named `df`. Note that when a variable is provided, the results are not displayed below the cell that invokes the magic command.

In [ ]:
%%bigquery df
SELECT name, SUM(number) as count
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY count DESC
LIMIT 10

In [ ]:
df

## Run a parameterized query

Parameterized queries are useful if you need to run a query with certain parameters that are calculated at run time. Note that the value types must be JSON serializable. The following example defines a parameters dictionary and passes it to the `--params` flag. The key of the dictionary is the name of the parameter, and the value of the dictionary is the value of the parameter.

In [ ]:
params = {"limit": 10}

In [ ]:
%%bigquery --params $params
SELECT name, SUM(number) as count
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY count DESC
LIMIT @limit